CF/Enums/ОбработчикиДрайверовПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ОбработчикиДрайверовПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СWebСервисОборудование</Name>
					<Comment>WebСервисОборудование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СДисплейПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СККМOffline</Name>
					<Comment>ККМОфлайн</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СПринтерЧеков</Name>
					<Comment>ПринтерЧеков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СРарусДисплеиПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СРарусФискальныеРегистраторыМебиус</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СРарусФискальныеРегистраторыФеликс</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1ССканерыШтрихкода</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1ССканерыШтрихкодаNative</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1ССчитывателиМагнитныхКарт</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1ССчитывателиМагнитныхКартNative</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СФискальныйРегистраторЭмулятор</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СЭвоторККМOffline</Name>
					<Comment>ККМОфлайн</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СЭквайринговыеТерминалыСбербанк</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикACOMВесыСПечатьюЭтикеток</Name>
					<Comment>ВесыСПечатьюЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикARCUS2ЭквайринговыеТерминалыIngenico</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикARSККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикCASВесыСПечатьюЭтикеток</Name>
					<Comment>ВесыСПечатьюЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикCASЭлектронныеВесы</Name>
					<Comment>ЭлектронныеВесы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикERFIDСчитывательRFID</Name>
					<Comment>СчитывательRFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикFITККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикIboxProПоддержкаMPosЭквайринга</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикIronLogicСчитывателиБесконтактныхКарт</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикISBCСчитывательRFID</Name>
					<Comment>СчитывательRFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикMPos2canЭквайринг</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикMSTARККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикNEWTONККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикPOSUAДисплеиПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикRightScanТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикSKAM1CЭквайринговыеСистемы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикTRPOSЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикUCSEFTPOSЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАТОЛВесыСПечатьюЭтикеток8X</Name>
					<Comment>ВесыСПечатьюЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолДисплеиПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолДисплеиПокупателя8X</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолККМOffline</Name>
					<Comment>ККМОфлайн</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолККТ54ФЗ10X</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолККТ54ФЗ9X</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолСканерыШтрихкода</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолСканерыШтрихкода8X</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолСчитывателиМагнитныхКарт</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолСчитывателиМагнитныхКарт8X</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолТерминалыСбораДанныхMobileLogistics</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолФискальныеРегистраторы8X</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолФискальныеРегистраторыУниверсальный</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолЭлектронныеВесы</Name>
					<Comment>ЭлектронныеВесы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолЭлектронныеВесы8X</Name>
					<Comment>ЭлектронныеВесы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикВерсияТK1Ф54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикВерсияТФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикГАЗПРОМБАНКЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикГексагонПринтераЭтикеток</Name>
					<Comment>ПринтерЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикГексагонСканерыШтрихкода</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикГексагонТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикДримкасККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикДримкасФискальныеРегистраторыVikiPrint</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИнитпроККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИНПАСЭквайринговыеТерминалыSmart</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИНПАСЭквайринговыеТерминалыUNIPOS</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИскраККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИскраФискальныеРегистраторыПрим</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикККСДисплеиПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикККСККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикККСФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикКлеверенсСчитывателиRFID</Name>
					<Comment>СчитывательRFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикКлеверенсТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикКристаллСервисДисплеиПокупателяVikiVision</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикКристаллСервисФискальныеРегистраторыPirit</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикМассаКВесыСПечатьюЭтикеток</Name>
					<Comment>ВесыСПечатьюЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикМассаКЭлектронныеВесы</Name>
					<Comment>ЭлектронныеВесы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикОРИОНФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикРБСВесыCПечатьюЭтикеток</Name>
					<Comment>ВесыСПечатьюЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСБРФЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодДисплеиПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодДисплеиПокупателяNative</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодПринтераЭтикетокGodexEZPL8Native</Name>
					<Comment>ПринтерЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодСканерыШтрихкода</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодСчитывательRFIDCipherLab</Name>
					<Comment>СчитывательRFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодТерминалыСбораДанныхNative</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканситиПринтераЭтикеток</Name>
					<Comment>ПринтерЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканситиТерминалСбораДанныхCitySoftBusiness</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканситиТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСчетмашККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМВесыСПечатьюЭтикеток</Name>
					<Comment>ВесыСПечатьюЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМВесыСПечатьюЭтикетокШтрихПринт</Name>
					<Comment>ВесыСПечатьюЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМДисплеиПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМККМOffline</Name>
					<Comment>ККМОфлайн</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМПлатежныйТерминалYarus</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМФискальныеРегистраторыУниверсальный</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМЭлектронныеВесы</Name>
					<Comment>ЭлектронныеВесы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМЭлектронныеВесыPOS2</Name>
					<Comment>ЭлектронныеВесы</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/CommonModules/МенеджерОборудованияКлиентПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает текущую дату, приведенную к часовому поясу сеанса.
// Предназначена для использования вместо функции ТекущаяДата().
//
// Возвращаемое значение:
//  Результат - текущая дата.
//
Функция ДатаСеанса() Экспорт
	
	Возврат ОбщегоНазначенияКлиент.ДатаСеанса();
	
КонецФункции

// Функция возвращает объект обработчика драйвера по его наименованию.
//
// Параметры:
//  ОбработчикДрайвера  - Перечисление, ссылка на обработчик драйвера подключаемого оборудования.
//  ЗагружаемыйДрайвер  - Булево, признак, что драйвер загружаемый
//  ТипОборудованияИмя  - Строка, представление типа оборудования
//
// Возвращаемое значение:
//  Результат - Используемый модуль обработчика драйвера.
//
Функция ПолучитьОбработчикДрайвера(ОбработчикДрайвера, ЗагружаемыйДрайвер, ТипОборудованияИмя) Экспорт
	
 // Используем универсальный обработчик драйвера по стандарту "1С:Совместимо".
#Если ВебКлиент Тогда
	Результат = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент; 
#Иначе
	Результат = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
#КонецЕсли

	// Обработчики драйверов не удовлетворяющие стандарту "1С:Совместимо".
	Если Не ЗагружаемыйДрайвер И ОбработчикДрайвера <> Неопределено Тогда
		
		// Сканеры штрихкода
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудование1ССканерыШтрихкодаКлиент;
		КонецЕсли;
		// Конец Сканеры штрихкода
		
		// Считыватели магнитных карт
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССчитывателиМагнитныхКарт") Тогда
			Возврат ПодключаемоеОборудование1ССчитывателиМагнитныхКартКлиент;
		КонецЕсли;
		// Конец Считыватели магнитных карт.
		
		// Весы с печатью этикеток
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикACOMВесыСПечатьюЭтикеток") Тогда
			Возврат ПодключаемоеОборудованиеACOMВесыСПечатьюЭтикетокКлиент;
		КонецЕсли;
		// Конец Весы с печатью этикеток.
		
		// ККМ Офлайн
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолККМOffline") Тогда
			Возврат ОфлайнОборудованиеАтолККМКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМККМOffline") Тогда
			Возврат ОфлайнОборудованиеШтрихМККМКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СККМOffline") Тогда
			Возврат ОфлайнОборудование1СККМКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СЭвоторККМOffline") Тогда
			Возврат ОфлайнОборудование1СЭвоторКлиент;
		КонецЕсли;
		// Конец ККМ Офлайн
		
		// Web-сервис оборудование
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СWebСервисОборудование") Тогда
			Возврат Неопределено;
		КонецЕсли;
		// Конец Web-сервис оборудование

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура отправляет электронное сообщение на электронную почта и абонентский номер.
//
Процедура НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер) Экспорт
	
	РассылкаЭлектронныхЧековКлиент.НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер);
	
КонецПроцедуры

// Начинает рассылку или ставит задачу на рассылку нефискальных документов.
// Которые заданы в шаблоне чека.
Процедура НачатьРассылкуНефискальныхДокументов(Параметры) Экспорт
	
	МаркетинговыеАкцииВызовСервера.НачатьРассылкуНефискальныхДокументов(Параметры.ВходныеПараметры[0]);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСОборудованиемСФормы

// Начать подключение необходимых типов оборудования при открытии формы.
//
// Параметры:
// Форма - УправляемаяФорма
// ПоддерживаемыеТипыПодключаемогоОборудования - Строка
//  Содержит перечень типов подключаемого оборудования, разделенных запятыми.
//
Процедура НачатьПодключениеОборудованиеПриОткрытииФормы(Форма, ПоддерживаемыеТипыПодключаемогоОборудования) Экспорт
	
	ОповещениеПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", МенеджерОборудованияКлиентПереопределяемый);
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(ОповещениеПриПодключении, Форма, ПоддерживаемыеТипыПодключаемогоОборудования);
	
КонецПроцедуры

// Начать отключать оборудование по типу при закрытии формы.
//
Процедура НачатьОтключениеОборудованиеПриЗакрытииФормы(Форма) Экспорт
	
	ОповещениеПриОтключении = Новый ОписаниеОповещения("ОтключитьОборудованиеЗавершение", МенеджерОборудованияКлиентПереопределяемый);
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(ОповещениеПриОтключении, Форма);
	
КонецПроцедуры

// Начать отключать оборудование по типу при закрытии формы - Завершение.
//
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Начать отключать оборудование по типу при закрытии формы - Завершение.
//
Процедура ОтключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При отключении оборудования произошла ошибка: ""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриОткрытии".
//
Процедура ЭкземплярОборудованияПриОткрытии(Объект, ЭтаФорма, Отказ) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗакрытием".
//
Процедура ЭкземплярОборудованияПередЗакрытием(Объект, ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписью".
//
Процедура ЭкземплярОборудованияПередЗаписью(Объект, ЭтаФорма, Отказ, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписи".
//
Процедура ЭкземплярОборудованияПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ОбработкаНавигационнойСсылки".
//
Процедура ЭкземплярОборудованияОбработкаНавигационнойСсылки(Объект, ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ТипОборудованияОбработкаВыбора".
//
Процедура ЭкземплярОборудованияТипОборудованияВыбор(Объект, ЭтаФорма, ЭтотОбъект, Элемент, ВыбранноеЗначение) Экспорт
	
	// Доступ к узлу есть только для соответствующего оборудования.
	ЭтаФорма.Элементы.ПравилоОбмена.Видимость = Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККМОфлайн")
		ИЛИ Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток")
		ИЛИ Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.УдалитьWebСервисОборудование");
	
КонецПроцедуры

// Производит получение события от устройсва.
//
Функция ПолучитьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки = "") Экспорт
	
	Результат = МенеджерОборудованияКлиент.ПолучитьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	Если Результат <> Неопределено Тогда
		
		ПараметрыБезОбработки = Результат.Параметр;
		Параметр = Результат.Параметр;
		Если Результат.ИмяСобытия = "ScanData" Тогда
			Если Параметр[1] = Неопределено Тогда
				Параметр = Параметр[0];
			Иначе
				Параметр = Параметр[1][1];
			КонецЕсли;
		ИначеЕсли Результат.ИмяСобытия ="TracksData" Тогда
			Параметр = Параметр[0];
		КонецЕсли;
		
		Результат.Параметр = Параметр;
		Результат.Вставить("ПараметрыБезОбработки", ПараметрыБезОбработки);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Прочее

Функция ОборудованиеПодключено(ИдентификаторУстройства) Экспорт
	
	ПодключенноеУстройство = МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, ИдентификаторУстройства);

	Если ПодключенноеУстройство = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ЕстьНеобработанноеСобытие() Экспорт
	
	Возврат (глПодключаемоеОборудованиеСобытиеОбработано = Ложь);
	
КонецФункции

Процедура ОбработатьСобытие() Экспорт
	
	глПодключаемоеОборудованиеСобытиеОбработано = Истина;
	
КонецПроцедуры

Процедура СообщитьОбОшибке(РезультатВыполнения) Экспорт
	
	ТекстСообщения = НСтр("ru = 'При выполнении операции произошла ошибка:""%ОписаниеОшибки%"".'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти
